app/controllers/encurtar_controller.rb

	def short
	  params[:url][:href].gsub!(" ","") unless params[:url][:href].blank?
---
SELECT * FROM "urls" WHERE ("urls"."href" = 'http://www.uol.com.br') LIMIT 1

	def go
		link = Link.find_by_atalho(params[:short_url])
		if link.nil?
			flash[:error] = "Link não encontrado no sistema"
			redirect_to root_path
		else
			link.visitas << Visita.create(:link => link)
---
SELECT * FROM "links" WHERE ("links"."atalho" IS NULL) LIMIT 1
INSERT INTO "visitas" ("link_id", "updated_at", "ip", "pais", "created_at") VALUES(2, '2010-10-22 10:49:45.474000', NULL, NULL, '2010-10-22 10:49:45.474000') RETURNING "id"

	def api
	  params[:url].gsub!(" ","") unless params[:url].blank?
---
SELECT * FROM "urls" WHERE ("urls".link_id = 12) LIMIT 1

	def info
	  @link = Link.find_by_atalho(params[:short_url])
---
SELECT * FROM "links" WHERE ("links"."atalho" = '1') LIMIT 1